app/controllers/pins_controller.rb

	def index
		@pins = Pin.all.order("created_at DESC")
---
SELECT "pins".* FROM "pins"  ORDER BY created_at DESC

	def create
		@Pin = current_user.pins.build(pin_params)

		if @Pin.save
---
INSERT INTO "pins" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", " this is my forth pin"], ["description", "pin.4"], ["user_id", 1], ["created_at", "2016-04-28 18:23:55.977681"], ["updated_at", "2016-04-28 18:23:55.977681"]]

	def update
		if @Pin.update(pin_params)
---
UPDATE "pins" SET "image_file_size" = ?, "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["image_file_size", 54399], ["image_updated_at", "2016-04-28 21:03:51.777318"], ["image_file_name", "Auchentoshan_12YO.jpg"], ["updated_at", "2016-04-28 21:03:52.770439"], ["id", 5]]

	def destroy
		@Pin.destroy
---
DELETE FROM "pins" WHERE "pins"."id" = ?  [["id", 1]]

	def find_pin
		@Pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 6]]